<a href="https://colab.research.google.com/github/sandeepa-oraon/DataAnalyses/blob/main/Pandas/dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
df= pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
#creating dataframe from list

lst= ['hello', 'my', 'name', 'is', 'sandeepa']
df= pd.DataFrame(lst)
print(df)

          0
0     hello
1        my
2      name
3        is
4  sandeepa

In [5]:
#creating dataframe from dist of lists
lst1={'Name': ['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}
df= pd.DataFrame(lst1)
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

##INDEXING (accessing and modifying)

In [13]:
data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}
index_val=[1, 2, 3,4,5]

In [14]:
df= pd.DataFrame(data, index=index_val)
print(df)

      Name  Age  Gender  Salary
1     John   25    Male   50000
2    Alice   30  Female   55000
3      Bob   22    Male   40000
4      Eve   35  Female   70000
5  Charlie   28    Male   48000

In [20]:
df.loc[1]['Age']

25

In [21]:
df.loc[1,'Age']

25

In [19]:
df_name =df.set_index('Name')
print(df_name)

         Age  Gender  Salary
Name
John      25    Male   50000
Alice     30  Female   55000
Bob       22    Male   40000
Eve       35  Female   70000
Charlie   28    Male   48000

In [23]:
df_name.loc['John']

Age          25
Gender     Male
Salary    50000
Name: John, dtype: object

In [24]:
df_name.loc['John','Gender']

'Male'

##Indexing and Selecting Data with Pandas